In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
df = pd.read_csv('datasets/unemployment.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 219 entries, 0 to 218
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country Name  219 non-null    object
 1   Country Code  219 non-null    object
 2   2010          219 non-null    float64
 3   2011          219 non-null    float64
 4   2012          219 non-null    float64
 5   2013          219 non-null    float64
 6   2014          219 non-null    float64
dtypes: float64(5), object(2)
memory usage: 12.1+ KB

In [5]:
df.head()

,Country Name,Country Code,2010,2011,2012,2013,2014
0,Afghanistan,AFG,20.600000,20.900000,19.700001,21.100000,20.799999
1,Angola,AGO,10.800000,10.700000,10.700000,10.600000,10.500000
2,Albania,ALB,25.799999,27.000000,28.299999,28.700001,29.200001
3,Arab World,ARB,25.022214,28.117516,29.113212,29.335306,29.704569
4,United Arab Emirates,ARE,9.800000,9.800000,9.800000,9.900000,10.000000

In [6]:
df.rename(columns= {'Country Name' : 'Country', 'Country Code': 'Code'} , inplace=True)
df.head()

,Country,Code,2010,2011,2012,2013,2014
0,Afghanistan,AFG,20.600000,20.900000,19.700001,21.100000,20.799999
1,Angola,AGO,10.800000,10.700000,10.700000,10.600000,10.500000
2,Albania,ALB,25.799999,27.000000,28.299999,28.700001,29.200001
3,Arab World,ARB,25.022214,28.117516,29.113212,29.335306,29.704569
4,United Arab Emirates,ARE,9.800000,9.800000,9.800000,9.900000,10.000000

In [7]:
df.set_index('Country')

,Code,2010,2011,2012,2013,2014
Country,,,,,,
Afghanistan,AFG,20.600000,20.900000,19.700001,21.100000,20.799999
Angola,AGO,10.800000,10.700000,10.700000,10.600000,10.500000
Albania,ALB,25.799999,27.000000,28.299999,28.700001,29.200001
Arab World,ARB,25.022214,28.117516,29.113212,29.335306,29.704569
United Arab Emirates,ARE,9.800000,9.800000,9.800000,9.900000,10.000000
...,...,...,...,...,...,...
"Yemen, Rep.",YEM,30.299999,30.000000,30.200001,30.200001,29.900000
South Africa,ZAF,50.799999,50.099998,52.200001,51.400002,52.599998
"Congo, Dem. Rep.",COD,12.300000,12.300000,12.300000,12.200000,11.900000
Zambia,ZMB,26.400000,26.600000,26.600000,25.500000,25.100000
Zimbabwe,ZWE,9.600000,8.300000,8.300000,8.900000,9.400000

In [ ]:
df_apps.groupby('Category').count().sort_values('App')['App'][::-1].plot(kind='bar', figsize = (20, 7))

In [ ]:
df_apps['Type'].fillna('Free', inplace = True)

In [ ]:
df_apps.groupby('Type').count()['App'].plot(kind="bar")